{"flutter_rust_bridge":"Flutter/Dart <-> Rust binding generator, feature-rich, but seamless and simple","build_runner":"A build system for Dart code generation and modular compilation.","crypto":"Implementations of SHA, MD5, and HMAC cryptographic functions.","archive":"Provides encoders and decoders for various archive and compression formats such as zip, tar, bzip2, gzip, and zlib.","jwt_decoder":"This small library helps you to decode Json Web Tokens, you can also know if a JWT is already expired.","json_serializable":"Automatically generate code for converting to and from JSON by annotating Dart classes.","uuid":"RFC4122 (v1, v4, v5, v6, v7, v8) UUID Generator and Parser for Dart\n","rxdart":"RxDart is an implementation of the popular ReactiveX api for asynchronous programming, leveraging the native Dart Streams api.\n","cross_file":"An abstraction to allow working with files across multiple platforms.","open_file":"A plug-in that can call native APP to open files with string result in flutter, support iOS(UTI) / android(intent) / PC(ffi) / web(dart:html)","xml2json":"An XML to JSON conversion package. Supports Badgerfish, GData, OpenRally and Parker conversions.","fx_trace":"Easy to trace and listen error/tips/log.","sentry_flutter":"Sentry SDK for Flutter. This package aims to support different Flutter targets by relying on the many platforms supported by Sentry with native SDKs.","sqflite":"Flutter plugin for SQLite, a self-contained, high-reliability, embedded, SQL database engine.","hive":"Lightweight and blazing fast key-value database written in pure Dart. Strongly encrypted using AES-256.","isar":"Extremely fast, easy to use, and fully async NoSQL database for Flutter.","shared_preferences":"Flutter plugin for reading and writing simple key-value pairs. Wraps NSUserDefaults on iOS and SharedPreferences on Android.","drift":"Drift is a reactive library to store relational data in Dart and Flutter applications.","objectbox":"Flutter database for super-fast NoSQL ACID compliant object persistence.","moor":"Moor is a safe and reactive persistence library for Dart applications","file_picker":"A package that allows you to use a native file explorer to pick single or multiple absolute file paths, with extension filtering support.","path_provider":"Flutter plugin for getting commonly used locations on host platform file systems, such as the temp and app data directories.","firebase_storage":"Flutter plugin for Firebase Cloud Storage, a powerful, simple, and cost-effective object storage service for Android and iOS.","permission_handler":"Permission plugin for Flutter. This plugin provides a cross-platform (iOS, Android) API to request and check permissions.","camera":"A Flutter plugin for controlling the camera. Supports previewing the camera feed, capturing images and video, and streaming image buffers to Dart.","geolocator":"Geolocation plugin for Flutter. This plugin provides a cross-platform (iOS, Android) API for generic location (GPS etc.) functions.","battery_plus":"Flutter plugin for accessing information about the battery state(full, charging, discharging).","sensors_plus":"Flutter plugin for accessing accelerometer, gyroscope, and magnetometer sensors.","device_info_plus":"Flutter plugin providing detailed information about the device (make, model, etc.), and Android or iOS version the app is running on.","package_info_plus":"Flutter plugin for querying information about the application package, such as CFBundleVersion on iOS or versionCode on Android.","connectivity_plus":"Flutter plugin for discovering the state of the network (WiFi & mobile/cellular) connectivity on Android and iOS.","share_plus":"Flutter plugin for sharing content via the platform share UI, using the ACTION_SEND intent on Android and UIActivityViewController on iOS.","url_launcher":"Flutter plugin for launching a URL. Supports web, phone, SMS, and email schemes.","flutter_blue":"Flutter plugin for connecting and communicating with Bluetooth Low Energy devices, on Android and iOS","flutter_local_notifications":"A cross platform plugin for displaying and scheduling local notifications for Flutter applications with the ability to customise for each platform.","flame":"A minimalist Flutter game engine, provides a nice set of somewhat independent modules you can choose from.","flame_forge2d":"Forge2D (Box2D) support for the Flame game engine. This uses the forge2d package and provides wrappers and components to be used inside Flame.","fluwx":"The capability of implementing WeChat SDKs in Flutter. With Fluwx, developers can use WeChatSDK easily, such as sharing, payment, lanuch mini program and etc.","in_app_purchase":"A Flutter plugin for in-app purchases. Exposes APIs for making in-app purchases through the App Store and Google Play.","go_router":"A declarative router for Flutter based on Navigation 2 supporting deep linking, data-driven routes and more","get_it":"Simple direct Service Locator that allows to decouple the interface from a concrete implementation and  to access the concrete implementation from everywhere in your App\"","firebase_core":"Flutter plugin for Firebase Core, enabling connecting to multiple Firebase apps.","oauth2":"A client library for authenticating with a remote service via OAuth2 on behalf of a user, and making authorized HTTP requests with the user's OAuth2 credentials.","sign_in_with_apple":"Flutter bridge to initiate Sign in with Apple (on iOS, macOS, and Android). Includes support for keychain entries as well as signing in with an Apple ID.","fx_framework":"fx framework for flutter.","video_player":"Flutter plugin for displaying inline video with other Flutter widgets on Android, iOS, macOS and web.","just_audio":"A feature-rich audio player for Flutter. Loop, clip and sequence any sound from any source (asset/file/URL/stream) in gapless playlists.","flame_audio":"Audio support for the Flame game engine, basically a thin wrapper around the audioplayers package.\n","qr_code_scanner_plus":"QR code scanner that can be embedded inside flutter. It uses zxing in Android and MTBBarcode scanner in iOS.","qr_flutter":"QR.Flutter is a Flutter library for simple and fast QR code rendering via a Widget or custom painter.\n","ffmpeg_kit_flutter":"FFmpeg Kit for Flutter. Supports Android, iOS and macOS platforms.","camera_android_camerax":"Android implementation of the camera plugin using the CameraX library.","chewie":"A video player for Flutter with Cupertino and Material play controls","photo_view":"Photo View provides a gesture sensitive zoomable widget. Photo View is largely used to show interactive images and other stuff such as SVG.","image_picker":"Flutter plugin for selecting images from the Android and iOS image library, and taking new pictures with the camera.","image":"Dart Image Library provides server and web apps the ability to load, manipulate, and save images with various image file formats.","flutter_image_compress":"Compress Pictures. Can effectively reduce the size of the transmission.","crop_image":"An image cropper widget, with 90-degree rotations. Supports mobile, web and desktop.","dio":"A powerful HTTP networking package,\nsupports Interceptors,\nAborting and canceling a request,\nCustom adapters, Transformers, etc.\n","http":"A composable, multi-platform, Future-based API for HTTP requests.","retrofit":"retrofit.dart is an dio client generator using source_gen and inspired by Chopper and Retrofit.","web_socket_channel":"StreamChannel wrappers for WebSockets. Provides a cross-platform WebSocketChannel API, a cross-platform implementation of that API that communicates over an underlying StreamChannel.","grpc":"Dart implementation of gRPC, a high performance, open-source universal RPC framework.","flutter_webrtc":"Flutter WebRTC plugin for iOS/Android/Desktop/Web, based on GoogleWebRTC.","provider":"A wrapper around InheritedWidget to make them easier to use and more reusable.","riverpod":"A reactive caching and data-binding framework. Riverpod makes working with asynchronous code a breeze.\n","flutter_riverpod":"A reactive caching and data-binding framework. Riverpod makes working with asynchronous code a breeze.\n","bloc":"A predictable state management library that helps implement the BLoC (Business Logic Component) design pattern.","flutter_bloc":"Flutter widgets that make it easy to implement the BLoC (Business Logic Component) design pattern. Built to be used with the bloc state management package.","mobx":"MobX is a library for reactively managing the state of your applications. Use the power of observables, actions, and reactions to supercharge your Dart and Flutter apps.","flutter_mobx":"Flutter integration for MobX. It provides a set of Observer widgets that automatically rebuild when the tracked observables change.","get":"Open screens/snackbars/dialogs without context, manage states and inject dependencies easily with GetX.","redux":"Redux is a predictable state container for Dart and Flutter apps","flutter_redux":"A set of utility Widgets that Provide and Connect to a Redux Store","signals":"Reactivity made simple. Do more by doing less. Supports Flutter and any Dart project including HTML/JS, CLI, Shelf Server, VM and more.","signals_flutter":"The signals library exposes four core functions which are the building blocks to model any business logic you can think of.","macos_ui":"Flutter widgets and themes implementing the current macOS design language.","fluent_ui":"Implements Microsoft's Windows User Interface in Flutter.","tolyui":"A responsive ui library for Flutter. Help developer build app easier.","rive":"Rive Flutter Runtime. This package provides runtime functionality for playing back and interacting with animations built with the Rive editor available at https://rive.app.","lottie":"Render After Effects animations natively on Flutter. This package is a pure Dart implementation of a Lottie player.","flutter_animate":"Add beautiful animated effects & builders in Flutter, via an easy, customizable, unified API.","flutter_quill":"A rich text editor built for Android, iOS, Web, and desktop platforms. It's the WYSIWYG editor and a Quill component for Flutter.","flutter_markdown":"A Markdown renderer for Flutter. Create rich text output, including text styles, tables, links, and more, from plain text data formatted with simple Markdown tags.","flutter_markdown_plus":"A Markdown renderer for Flutter. Create rich text output, including text styles, tables, links, and more, from plain text data formatted with simple Markdown tags.","scrollable_positioned_list":"A list with helper methods to programmatically scroll to an item.\n","scroll_to_index":"Scroll to a specific child of any scrollable widget in Flutter","pull_to_refresh":"a widget provided to the flutter scroll component drop-down refresh and pull up load.","webview_flutter":"A Flutter plugin that provides a WebView widget backed by the system webview.","flutter_inappwebview":"A Flutter plugin that allows you to add an inline webview, to use an headless webview, and to open an in-app browser window.","tolyui_refresh":"A package to easy use pull to refresh and load more.","flutter_slidable":"A Flutter implementation of slidable list item with directional slide actions that can be dismissed.","flutter_svg":"An SVG rendering and widget library for Flutter, which allows painting and displaying Scalable Vector Graphics 1.1 files.","flutter_screenutil":"A flutter plugin for adapting screen and font size.Guaranteed to look good on different models","google_fonts":"A Flutter package to use fonts from fonts.google.com. Supports HTTP fetching, caching, and asset bundling."}